;--------------------------------------------------
;НАВИГАЦИЯ И РЕДАКТИРОВАНИЕ С ЗАЖАТОЙ КЛАВИШЕЙ CAPSLOCK
;(выполняющей функцию RCtrl после внесения изменений в реестр)
;--------------------------------------------------

;Перемещение курсора по-символьно
;--------------------------------------------------
;RCtrl + I
>^vk49::send {Up}
;RCtrl + J
>^vk4A::send {Left}
;RCtrl + K
>^vk4B::send {Down}
;RCtrl + L
>^vk4C::send {Right}

;Выделение по-символьно и по-строчно
;--------------------------------------------------
;RCtrl + Shift + I
>^+vk49::send +{Up}
;RCtrl + Shift + J
>^+vk4A::send +{Left}
;RCtrl + Shift + K
>^+vk4B::send +{Down}
;RCtrl + Shift + L
>^+vk4C::send +{Right}

;Перемещение курсора по-словам
;--------------------------------------------------
;RCtrl + H
>^vk48::send ^{Left}
;RCtrl + (;:)
>^vkBA::send ^{Right}

;Выделение по-словам
;--------------------------------------------------
;RCtrl + Shift + H
>^+vk48::send ^+{Left}
;RCtrl + Shift + (;:)
>^+vkBA::send ^+{Right}

;Перемещение курсора в начало и конец строки
;--------------------------------------------------
;RCtrl + U
>^vk55::send {Home}
;RCtrl + M
>^vk4D::send {End}

;Перемещение курсора в начало и конец файла
;--------------------------------------------------
;RCtrl + Y
>^vk59::send ^{Home}
;RCtrl + N
>^vk4E::send ^{End}

;Выделение до начала или конца строки
;--------------------------------------------------
;RCtrl + Shift + U
>^+vk55::send +{Home}
;RCtrl + Shift + M
>^+vk4D::send +{End}

;Выделение до начала или конца файла
;--------------------------------------------------
;RCtrl + Shift + Y
>^+vk59::send ^+{Home}
;RCtrl + Shift + N
>^+vk4E::send ^+{End}

;По-страничная навигация (переключение между вкладками)
;--------------------------------------------------
;RCtrl + O
>^vk4F::send {PgUp}
;RCtrl + (.>)
>^vkBE::send {PgDn}
;RCtrl + P
>^vk50::send ^{PgUp}
;RCtrl + (/?)
>^vkBF::send ^{PgDn}

;Удаление посимвольно, по словам, построчно.
;Копирование, вырезание слов и строк
;--------------------------------------------------
+BS::send ^+{Left}{BS}
;RCtrl + BS удаление строки
>^BS::send {Home}{Shift Down}{End}{Shift Up}{BS}
;RCtrl + C копирование строки
>^vk43::send {Home}{Shift Down}{End}{Shift Up}^{vk43}{End}
;RCtrl + X вырезание строки
>^vk58::send {Home}{Shift Down}{End}{Shift Up}^{vk58}
;RCtrl + Shift + C копирование слова
>^+vk43::send ^{Left}{Shift Down}^{Right}{Shift Up}^{vk43}{Right}
;вырезание слова RCtrl + Shift + X (не работает почему-то)
>^+vk58::send ^{Left}{Shift Down}^{Right}{Shift Up}^{vk58}
;RCtrl + A выделение строки
>^vk41::send {Home}{Shift Down}{End}{Shift Up}

;Включение режима замены (Insert)
;--------------------------------------------------
>^vkBC::send {Ins}
;/--------------------------------------------------/
